<a href="https://colab.research.google.com/github/Vikas-1093/Data-science/blob/main/Data_Cleaning_and_Preparation_code.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import pandas as pd
import numpy as np

# **Handling Missing Data**

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
string_data[0] = None

In [9]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**Filtering Out Missing Data**

In [10]:
from numpy import nan as NA

In [11]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [12]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [49]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
...:                     [NA, NA, NA], [NA, 6.5, 3.]])

In [20]:
cleaned = data.dropna()

In [21]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4] = NA

In [26]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [28]:
df = pd.DataFrame(np.random.randn(7, 3))

In [29]:
df.iloc[:4, 1] = NA

In [30]:
df.iloc[:2, 2] = NA

In [31]:
df

          0         1         2
0  1.014348       NaN       NaN
1 -1.031359       NaN       NaN
2 -0.478219       NaN  0.001901
3 -0.601412       NaN  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [32]:
df.dropna()

          0         1         2
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [33]:
df.dropna(thresh=2)

          0         1         2
2 -0.478219       NaN  0.001901
3 -0.601412       NaN  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

**Filling In Missing Data**

In [34]:
df.fillna(0)

          0         1         2
0  1.014348  0.000000  0.000000
1 -1.031359  0.000000  0.000000
2 -0.478219  0.000000  0.001901
3 -0.601412  0.000000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [35]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  1.014348  0.500000  0.000000
1 -1.031359  0.500000  0.000000
2 -0.478219  0.500000  0.001901
3 -0.601412  0.500000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [36]:
_ = df.fillna(0, inplace=True)

In [37]:
df

          0         1         2
0  1.014348  0.000000  0.000000
1 -1.031359  0.000000  0.000000
2 -0.478219  0.000000  0.001901
3 -0.601412  0.000000  0.935506
4  0.141575  1.831507 -0.223781
5  1.755378  0.326890 -2.019358
6  0.818176 -0.917078 -0.971411

In [38]:
df = pd.DataFrame(np.random.randn(6, 3))

In [39]:
df.iloc[2:, 1] = NA

In [40]:
df.iloc[4:, 2] = NA

In [41]:
df

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612       NaN -0.999486
3 -0.020973       NaN  0.970507
4 -0.287883       NaN       NaN
5  0.004799       NaN       NaN

In [42]:
df.fillna(method='ffill')

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612 -2.183754 -0.999486
3 -0.020973 -2.183754  0.970507
4 -0.287883 -2.183754  0.970507
5  0.004799 -2.183754  0.970507

In [45]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.452117 -0.827870  0.673380
1  0.784668 -2.183754 -0.855665
2  1.991612 -2.183754 -0.999486
3 -0.020973 -2.183754  0.970507
4 -0.287883       NaN  0.970507
5  0.004799       NaN  0.970507

In [46]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [47]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

**Data Transformation**

  **Removing Duplicates**

In [61]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
....: 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [62]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [65]:
data['v1'] = range(7)

In [66]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [67]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

**Transforming Data Using a Function or Mapping**

In [69]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
....: 'Pastrami', 'corned beef', 'Bacon',
....: 'pastrami', 'honey ham', 'nova lox'],
....: 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [70]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [71]:
lowercased = data['food'].str.lower()

In [72]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [73]:
data['animal'] = lowercased.map(meat_to_animal)

In [74]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [75]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

**Replacing Values**

In [77]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [78]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [79]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [80]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [81]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

**Renaming Axis Indexes**

In [82]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
....: index=['Ohio', 'Colorado', 'New York'],
....: columns=['one', 'two', 'three', 'four'])

In [83]:
transform = lambda x: x[:4].upper()

In [90]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [91]:
data.index = data.index.map(transform)

In [92]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [93]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [94]:
data.rename(index={'OHIO': 'INDIANA'},
....: columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [96]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11